Avnet-Silica-team/NBIOTBG96SHIELD-Azure-example/Projects/Multi/Applications/Azure_Sns_DM/Src/platform_STM32Cube_NucleoF401RE.c
  if(TargetBoardFeatures.HWAdvanceFeatures) {
    InitHWFeatures();
  }
  
  /* Set Full Scale to +/-2g */
  (TargetBoardFeatures.SnsAltFunc ? BSP_ACCELERO_Set_FS_Value_IKS01A2 : BSP_ACCELERO_Set_FS_Value)(TargetBoardFeatures.HandleAccSensor,2.0f);

  /* initialize timers */
  InitTimers();
  AZURE_PRINTF("Init Application's Timers\r\n");

  /* Initialize random number generartion */
#ifdef USE_MBED_TLS
  srand(HAL_GetTick());
  AZURE_PRINTF("Init Random Number Generator\r\n");
#endif /* USE_MBED_TLS*/
    
  /* Enabling HW Features... FreeFall */
  EnableHWFreeFall();

  /* Check if NFC is present */
  if(TT4_Init() == SUCCESS) {
    AZURE_PRINTF("X-NUCLEO-NFC01A1 is present\r\n");
    TargetBoardFeatures.NFCInitialized = 1;
  }

  /* Initializes Timers for GSM */
  BG96_Timer_Config();
  AZURE_PRINTF("Init BG96's Timers\r\n");

  /* Initializes UART1 and GPIO pins for GSM module BG96 */
  BG96_Configuration();
  AZURE_PRINTF("Init BG96's UART & GPIO\r\n");

  /* Set the WIFI Credential and Connection String */
  {
    char console_input[128];
    int32_t NecessityToSaveMMD=0;
    MDM_knownGMD_t known_MetaData[]={
      {GMD_BG96,sizeof(BG96_CredAcc_t)},
#ifndef AZURE_ENABLE_REGISTRATION
      {GMD_AZURE,sizeof(AzureConnection_t)},
#endif /* AZURE_ENABLE_REGISTRATION */
      {GMD_END    ,0}/* THIS MUST BE THE LAST ONE */
    };

    AZURE_PRINTF("--------------------------\r\n");
    AZURE_PRINTF("|    META Data info       |\r\n");
    AZURE_PRINTF("--------------------------\r\n");		
		
		    /* Initialize the MetaDataManager */
    InitMetaDataManager((void *)&known_MetaData,MDM_DATA_TYPE_GMD,NULL);

    AZURE_PRINTF("--------------------------\r\n");
    AZURE_PRINTF("|    GSM Credential       |\r\n");
    AZURE_PRINTF("--------------------------\r\n");
    
    /* Recall the WIFI Credential saved */
    memset(&BG96_CredAcc,0,sizeof(BG96_CredAcc_t));
    MDM_ReCallGMD(GMD_BG96,(void *)&BG96_CredAcc);

    if(BG96_CredAcc.sim_pin[0]==0) {
      sprintf(BG96_CredAcc.sim_pin,"%s",AZURE_DEFAULT_SIMPIN);
      sprintf(BG96_CredAcc.sim_apn,"%s",AZURE_DEFAULT_APN);
      //WIFI_CredAcc.mode = AZURE_DEFAULT_PRIV_MODE;
      AZURE_PRINTF("\tDefault SIM PIN   : %s\r\n",BG96_CredAcc.sim_pin);
      AZURE_PRINTF("\tDefault APN : %s\r\n",BG96_CredAcc.sim_apn);
      //AZURE_PRINTF("\tDefault EncMode: %s\r\n",(WIFI_CredAcc.mode == None) ? "Open" : ((WIFI_CredAcc.mode == WEP) ? "WEP" : "WPA2/WPA2-Personal"));
    } else {
      AZURE_PRINTF("\tSaved SIM PIN   : %s\r\n",BG96_CredAcc.sim_pin);
      AZURE_PRINTF("\tSaved APN : %s\r\n",BG96_CredAcc.sim_apn);
      //AZURE_PRINTF("\tSaved EncMode: %s\r\n",(WIFI_CredAcc.mode == None) ? "Open" : ((WIFI_CredAcc.mode == WEP) ? "WEP" : "WPA2/WPA2-Personal"));
    }

    AZURE_PRINTF("Wait 3 seconds for allowing User Button Control for changing it\r\n");
    {
      int32_t CountOn,CountOff;
      for(CountOn=0;CountOn<3;CountOn++) {
        BSP_LED_On(LED2);
        for(CountOff=0;CountOff<10;CountOff++) {
          if(CountOff==2) {
            BSP_LED_Off(LED2);
          }
          /* Handle user button */
          if(ButtonPressed) {
            CounterButtonPress++;
            ButtonPressed=0;
            goto INSERT_LABEL1;
          }
          HAL_Delay(100);
        }
      }
    }
INSERT_LABEL1:
    if(CounterButtonPress) {
      /* Enabling UART interaction */
      AZURE_PRINTF("\r\nDo you want to change them?(y/n)\r\n");
      scanf("%s",console_input);
      if((console_input[0]=='y') || (console_input[0]=='Y'))
				{
        int32_t ReadFromTerminal=1;

				#if 0
				/* If the NFC is present */
        if(TargetBoardFeatures.NFCInitialized) {
          AZURE_PRINTF("\tDo you want to read them from NFC?(y/n)\r\n");
          scanf("%s",console_input);
          if(console_input[0]=='y') {
            sWifiTokenInfo TokenInfo;
            if(TT4_ReadWifiToken(&TokenInfo) == SUCCESS) {
              ReadFromTerminal=0;

              sprintf(BG96_CredAcc.sim_pin,"%s",TokenInfo.NetworkSSID);
              sprintf(BG96_CredAcc.sim_apn,"%s",TokenInfo.NetworkKey);

              if (strcmp(TokenInfo.AuthenticationType,"NONE")==0) {
                WIFI_CredAcc.mode = None;
              } else if(strcmp(TokenInfo.AuthenticationType,"WEP")==0) {
                WIFI_CredAcc.mode = WEP;
              } else {
                WIFI_CredAcc.mode = WPA_Personal;
              }
            } else {
              AZURE_PRINTF("Err reading the WIFI's credentials from NFC\r\n");
              AZURE_PRINTF("Add them manually\r\n");
            }
          }
        }
				#endif
				
        if(ReadFromTerminal==1) {
          AZURE_PRINTF("\r\nEnter the SIM PIN:\r\n");
          scanf("%s",console_input);
          sprintf(BG96_CredAcc.sim_pin,"%s",console_input);
          AZURE_PRINTF("\r\nEnter the APN:\r\n");
          scanf("%s",console_input);
          sprintf(BG96_CredAcc.sim_apn,"%s",console_input);
					/*
          AZURE_PRINTF("\r\nEnter the encryption mode(0:Open, 1:WEP, 2:WPA2/WPA2-Personal):\r\n");
          scanf("%s",console_input);
          switch(console_input[0]){
            case '0':
              WIFI_CredAcc.mode = None;
            break;
            case '1':
              WIFI_CredAcc.mode = WEP;
            break;
            case '2':
              WIFI_CredAcc.mode = WPA_Personal;
            break;
            default:
              AZURE_PRINTF("\r\nWrong Entry. Priv Mode is not compatible\r\n");
              AzureExit(AZURE_ERR_WIFI_CRED);
          }
					*/
        }
        AZURE_PRINTF("\tNew SIM PIN   : %s\r\n",BG96_CredAcc.sim_pin);
        AZURE_PRINTF("\tNew APN : %s\r\n",BG96_CredAcc.sim_apn);
        //AZURE_PRINTF("\tNew EncMode: %s\r\n",(WIFI_CredAcc.mode == None) ? "Open" : ((WIFI_CredAcc.mode == WEP) ? "WEP" : "WPA2/WPA2-Personal"));

        /* Save the WIFI Credential on MetaDataManager */
        MDM_SaveGMD(GMD_BG96,(void *)&BG96_CredAcc);

        /* Will be Necessary Save the Meta Data Manager in Flash */
        NecessityToSaveMMD=1;

        AZURE_PRINTF("-----------------------------\r\n");
      }
      AZURE_PRINTF("\r\n");
    }

